Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM-GPM-0XX_DFP/1.3.50/include/proc/p32mm0128gpm036.h
extern volatile __CCP5CON1bits_t CCP5CON1bits __asm__ ("CCP5CON1") __attribute__((section("sfrs"), address(0xBF800500)));
extern volatile uint32_t        CCP5CON1CLR __attribute__((section("sfrs"),address(0xBF800504)));
extern volatile uint32_t        CCP5CON1SET __attribute__((section("sfrs"),address(0xBF800508)));
extern volatile uint32_t        CCP5CON1INV __attribute__((section("sfrs"),address(0xBF80050C)));
#define CCP5CON2 CCP5CON2
extern volatile uint32_t   CCP5CON2 __attribute__((section("sfrs"), address(0xBF800510)));
typedef struct {
  uint32_t ASDG:8;
  uint32_t :4;
  uint32_t SSDG:1;
  uint32_t :1;
  uint32_t ASDGM:1;
  uint32_t PWMRSEN:1;
  uint32_t ICS:3;
  uint32_t AUXOUT:2;
  uint32_t :1;
  uint32_t ICGSM:2;
  uint32_t OCAEN:1;
  uint32_t :6;
  uint32_t OENSYNC:1;
} __CCP5CON2bits_t;
extern volatile __CCP5CON2bits_t CCP5CON2bits __asm__ ("CCP5CON2") __attribute__((section("sfrs"), address(0xBF800510)));
extern volatile uint32_t        CCP5CON2CLR __attribute__((section("sfrs"),address(0xBF800514)));
extern volatile uint32_t        CCP5CON2SET __attribute__((section("sfrs"),address(0xBF800518)));
extern volatile uint32_t        CCP5CON2INV __attribute__((section("sfrs"),address(0xBF80051C)));
#define CCP5CON3 CCP5CON3
extern volatile uint32_t   CCP5CON3 __attribute__((section("sfrs"), address(0xBF800520)));
typedef struct {
  uint32_t :18;
  uint32_t PSSACE:2;
  uint32_t :1;
  uint32_t POLACE:1;
  uint32_t :6;
  uint32_t OSCNT:3;
  uint32_t OETRIG:1;
} __CCP5CON3bits_t;
extern volatile __CCP5CON3bits_t CCP5CON3bits __asm__ ("CCP5CON3") __attribute__((section("sfrs"), address(0xBF800520)));
extern volatile uint32_t        CCP5CON3CLR __attribute__((section("sfrs"),address(0xBF800524)));
extern volatile uint32_t        CCP5CON3SET __attribute__((section("sfrs"),address(0xBF800528)));
extern volatile uint32_t        CCP5CON3INV __attribute__((section("sfrs"),address(0xBF80052C)));
#define CCP5STAT CCP5STAT
extern volatile uint32_t   CCP5STAT __attribute__((section("sfrs"), address(0xBF800530)));
typedef struct {
  uint32_t ICBNE:1;
  uint32_t ICOV:1;
  uint32_t ICDIS:1;
  uint32_t SCEVT:1;
  uint32_t ASEVT:1;
  uint32_t TRCLR:1;
  uint32_t TRSET:1;
  uint32_t CCPTRIG:1;
  uint32_t :2;
  uint32_t ICGARM:1;
  uint32_t :5;
  uint32_t RAWIP:1;
  uint32_t RBWIP:1;
  uint32_t TMRLWIP:1;
  uint32_t TMRHWIP:1;
  uint32_t PRLWIP:1;
} __CCP5STATbits_t;
extern volatile __CCP5STATbits_t CCP5STATbits __asm__ ("CCP5STAT") __attribute__((section("sfrs"), address(0xBF800530)));
extern volatile uint32_t        CCP5STATCLR __attribute__((section("sfrs"),address(0xBF800534)));
extern volatile uint32_t        CCP5STATSET __attribute__((section("sfrs"),address(0xBF800538)));
extern volatile uint32_t        CCP5STATINV __attribute__((section("sfrs"),address(0xBF80053C)));
#define CCP5TMR CCP5TMR
extern volatile uint32_t   CCP5TMR __attribute__((section("sfrs"), address(0xBF800540)));
typedef union {
  struct {
    uint32_t TMRL:16;
    uint32_t TMRH:16;
  };
  struct {
    uint32_t TMR:32;
  };
} __CCP5TMRbits_t;
extern volatile __CCP5TMRbits_t CCP5TMRbits __asm__ ("CCP5TMR") __attribute__((section("sfrs"), address(0xBF800540)));
extern volatile uint32_t        CCP5TMRCLR __attribute__((section("sfrs"),address(0xBF800544)));
extern volatile uint32_t        CCP5TMRSET __attribute__((section("sfrs"),address(0xBF800548)));
extern volatile uint32_t        CCP5TMRINV __attribute__((section("sfrs"),address(0xBF80054C)));
#define CCP5PR CCP5PR
extern volatile uint32_t   CCP5PR __attribute__((section("sfrs"), address(0xBF800550)));
typedef union {
  struct {
    uint32_t PRL:16;
    uint32_t PRH:16;
  };
  struct {
    uint32_t PR:32;
  };
} __CCP5PRbits_t;
extern volatile __CCP5PRbits_t CCP5PRbits __asm__ ("CCP5PR") __attribute__((section("sfrs"), address(0xBF800550)));
extern volatile uint32_t        CCP5PRCLR __attribute__((section("sfrs"),address(0xBF800554)));
extern volatile uint32_t        CCP5PRSET __attribute__((section("sfrs"),address(0xBF800558)));
extern volatile uint32_t        CCP5PRINV __attribute__((section("sfrs"),address(0xBF80055C)));
#define CCP5RA CCP5RA
extern volatile uint32_t   CCP5RA __attribute__((section("sfrs"), address(0xBF800560)));
typedef struct {
  uint32_t CMPA:16;
} __CCP5RAbits_t;
extern volatile __CCP5RAbits_t CCP5RAbits __asm__ ("CCP5RA") __attribute__((section("sfrs"), address(0xBF800560)));
extern volatile uint32_t        CCP5RACLR __attribute__((section("sfrs"),address(0xBF800564)));
extern volatile uint32_t        CCP5RASET __attribute__((section("sfrs"),address(0xBF800568)));
extern volatile uint32_t        CCP5RAINV __attribute__((section("sfrs"),address(0xBF80056C)));
#define CCP5RB CCP5RB
extern volatile uint32_t   CCP5RB __attribute__((section("sfrs"), address(0xBF800570)));
typedef struct {
  uint32_t CMPB:16;
} __CCP5RBbits_t;
extern volatile __CCP5RBbits_t CCP5RBbits __asm__ ("CCP5RB") __attribute__((section("sfrs"), address(0xBF800570)));
extern volatile uint32_t        CCP5RBCLR __attribute__((section("sfrs"),address(0xBF800574)));
extern volatile uint32_t        CCP5RBSET __attribute__((section("sfrs"),address(0xBF800578)));
extern volatile uint32_t        CCP5RBINV __attribute__((section("sfrs"),address(0xBF80057C)));
#define CCP5BUF CCP5BUF
extern volatile uint32_t   CCP5BUF __attribute__((section("sfrs"), address(0xBF800580)));
typedef union {
  struct {
    uint32_t BUFL:16;
    uint32_t BUFH:16;
  };
  struct {
    uint32_t BUF:32;
  };
} __CCP5BUFbits_t;
extern volatile __CCP5BUFbits_t CCP5BUFbits __asm__ ("CCP5BUF") __attribute__((section("sfrs"), address(0xBF800580)));
extern volatile uint32_t        CCP5BUFCLR __attribute__((section("sfrs"),address(0xBF800584)));
extern volatile uint32_t        CCP5BUFSET __attribute__((section("sfrs"),address(0xBF800588)));
extern volatile uint32_t        CCP5BUFINV __attribute__((section("sfrs"),address(0xBF80058C)));
#define CCP6CON1 CCP6CON1
extern volatile uint32_t   CCP6CON1 __attribute__((section("sfrs"), address(0xBF800600)));
typedef struct {
  uint32_t MOD:4;
  uint32_t CCSEL:1;
  uint32_t T32:1;
  uint32_t TMRPS:2;
  uint32_t CLKSEL:3;
  uint32_t TMRSYNC:1;
  uint32_t CCPSLP:1;
  uint32_t SIDL:1;
  uint32_t :1;
  uint32_t ON:1;
  uint32_t SYNC:5;
  uint32_t ALTSYNC:1;
  uint32_t ONESHOT:1;
  uint32_t TRIGEN:1;
  uint32_t OPS:4;
  uint32_t :2;
  uint32_t RTRGEN:1;
  uint32_t OPSSRC:1;
} __CCP6CON1bits_t;
