Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM-GPM-0XX_DFP/1.3.50/include/proc/p32mm0128gpm036.h
extern volatile __PMD7bits_t PMD7bits __asm__ ("PMD7") __attribute__((section("sfrs"), address(0xBF803620)));
extern volatile uint32_t        PMD7CLR __attribute__((section("sfrs"),address(0xBF803624)));
extern volatile uint32_t        PMD7SET __attribute__((section("sfrs"),address(0xBF803628)));
extern volatile uint32_t        PMD7INV __attribute__((section("sfrs"),address(0xBF80362C)));
#define CFGCON CFGCON
extern volatile uint32_t   CFGCON __attribute__((section("sfrs"), address(0xBF803640)));
typedef struct {
  uint32_t TDOEN:1;
  uint32_t FAEN:1;
  uint32_t :1;
  uint32_t JTAGEN:1;
  uint32_t :4;
  uint32_t RPFA:1;
  uint32_t :7;
  uint32_t EXECADDR:8;
  uint32_t BMXARB:2;
  uint32_t :1;
  uint32_t BMXERRDIS:1;
} __CFGCONbits_t;
extern volatile __CFGCONbits_t CFGCONbits __asm__ ("CFGCON") __attribute__((section("sfrs"), address(0xBF803640)));
extern volatile uint32_t        CFGCONCLR __attribute__((section("sfrs"),address(0xBF803644)));
extern volatile uint32_t        CFGCONSET __attribute__((section("sfrs"),address(0xBF803648)));
extern volatile uint32_t        CFGCONINV __attribute__((section("sfrs"),address(0xBF80364C)));
#define DEVID DEVID
extern volatile uint32_t   DEVID __attribute__((section("sfrs"), address(0xBF803660)));
typedef struct {
  uint32_t MAINID:12;
  uint32_t PN:16;
  uint32_t VER:4;
} __DEVIDbits_t;
extern volatile __DEVIDbits_t DEVIDbits __asm__ ("DEVID") __attribute__((section("sfrs"), address(0xBF803660)));
extern volatile uint32_t        DEVIDCLR __attribute__((section("sfrs"),address(0xBF803664)));
extern volatile uint32_t        DEVIDSET __attribute__((section("sfrs"),address(0xBF803668)));
extern volatile uint32_t        DEVIDINV __attribute__((section("sfrs"),address(0xBF80366C)));
#define SYSKEY SYSKEY
extern volatile uint32_t   SYSKEY __attribute__((section("sfrs"), address(0xBF803670)));
typedef struct {
  uint32_t SYSKEY:32;
} __SYSKEYbits_t;
extern volatile __SYSKEYbits_t SYSKEYbits __asm__ ("SYSKEY") __attribute__((section("sfrs"), address(0xBF803670)));
extern volatile uint32_t        SYSKEYCLR __attribute__((section("sfrs"),address(0xBF803674)));
extern volatile uint32_t        SYSKEYSET __attribute__((section("sfrs"),address(0xBF803678)));
extern volatile uint32_t        SYSKEYINV __attribute__((section("sfrs"),address(0xBF80367C)));
#define WDTCON WDTCON
extern volatile uint32_t   WDTCON __attribute__((section("sfrs"), address(0xBF803990)));
typedef struct {
  uint32_t WDTWINEN:1;
  uint32_t SLPDIV:5;
  uint32_t CLKSEL:2;
  uint32_t RUNDIV:5;
  uint32_t :2;
  uint32_t ON:1;
  uint32_t WDTCLRKEY:16;
} __WDTCONbits_t;
extern volatile __WDTCONbits_t WDTCONbits __asm__ ("WDTCON") __attribute__((section("sfrs"), address(0xBF803990)));
extern volatile uint32_t        WDTCONCLR __attribute__((section("sfrs"),address(0xBF803994)));
extern volatile uint32_t        WDTCONSET __attribute__((section("sfrs"),address(0xBF803998)));
extern volatile uint32_t        WDTCONINV __attribute__((section("sfrs"),address(0xBF80399C)));
#define T1CON T1CON
extern volatile uint32_t   T1CON __attribute__((section("sfrs"), address(0xBF808000)));
typedef union {
  struct {
    uint32_t :1;
    uint32_t TCS:1;
    uint32_t TSYNC:1;
    uint32_t :1;
    uint32_t TCKPS:2;
    uint32_t :1;
    uint32_t TGATE:1;
    uint32_t TECS:2;
    uint32_t :1;
    uint32_t TWIP:1;
    uint32_t TWDIS:1;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t :4;
    uint32_t TCKPS0:1;
    uint32_t TCKPS1:1;
    uint32_t :2;
    uint32_t TECS0:1;
    uint32_t TECS1:1;
  };
  struct {
    uint32_t :13;
    uint32_t TSIDL:1;
    uint32_t :1;
    uint32_t TON:1;
  };
  struct {
    uint32_t w:32;
  };
} __T1CONbits_t;
extern volatile __T1CONbits_t T1CONbits __asm__ ("T1CON") __attribute__((section("sfrs"), address(0xBF808000)));
extern volatile uint32_t        T1CONCLR __attribute__((section("sfrs"),address(0xBF808004)));
extern volatile uint32_t        T1CONSET __attribute__((section("sfrs"),address(0xBF808008)));
extern volatile uint32_t        T1CONINV __attribute__((section("sfrs"),address(0xBF80800C)));
#define TMR1 TMR1
extern volatile uint32_t   TMR1 __attribute__((section("sfrs"), address(0xBF808010)));
extern volatile uint32_t        TMR1CLR __attribute__((section("sfrs"),address(0xBF808014)));
extern volatile uint32_t        TMR1SET __attribute__((section("sfrs"),address(0xBF808018)));
extern volatile uint32_t        TMR1INV __attribute__((section("sfrs"),address(0xBF80801C)));
#define PR1 PR1
extern volatile uint32_t   PR1 __attribute__((section("sfrs"), address(0xBF808020)));
extern volatile uint32_t        PR1CLR __attribute__((section("sfrs"),address(0xBF808024)));
extern volatile uint32_t        PR1SET __attribute__((section("sfrs"),address(0xBF808028)));
extern volatile uint32_t        PR1INV __attribute__((section("sfrs"),address(0xBF80802C)));
#define T2CON T2CON
extern volatile uint32_t   T2CON __attribute__((section("sfrs"), address(0xBF808040)));
typedef union {
  struct {
    uint32_t :1;
    uint32_t TCS:1;
    uint32_t :1;
    uint32_t T32:1;
    uint32_t TCKPS:3;
    uint32_t TGATE:1;
    uint32_t :5;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t :4;
    uint32_t TCKPS0:1;
    uint32_t TCKPS1:1;
    uint32_t TCKPS2:1;
  };
  struct {
    uint32_t :13;
    uint32_t TSIDL:1;
    uint32_t :1;
    uint32_t TON:1;
  };
  struct {
    uint32_t w:32;
  };
} __T2CONbits_t;
extern volatile __T2CONbits_t T2CONbits __asm__ ("T2CON") __attribute__((section("sfrs"), address(0xBF808040)));
extern volatile uint32_t        T2CONCLR __attribute__((section("sfrs"),address(0xBF808044)));
extern volatile uint32_t        T2CONSET __attribute__((section("sfrs"),address(0xBF808048)));
extern volatile uint32_t        T2CONINV __attribute__((section("sfrs"),address(0xBF80804C)));
#define TMR2 TMR2
extern volatile uint32_t   TMR2 __attribute__((section("sfrs"), address(0xBF808050)));
extern volatile uint32_t        TMR2CLR __attribute__((section("sfrs"),address(0xBF808054)));
extern volatile uint32_t        TMR2SET __attribute__((section("sfrs"),address(0xBF808058)));
extern volatile uint32_t        TMR2INV __attribute__((section("sfrs"),address(0xBF80805C)));
#define PR2 PR2
extern volatile uint32_t   PR2 __attribute__((section("sfrs"), address(0xBF808060)));
extern volatile uint32_t        PR2CLR __attribute__((section("sfrs"),address(0xBF808064)));
extern volatile uint32_t        PR2SET __attribute__((section("sfrs"),address(0xBF808068)));
extern volatile uint32_t        PR2INV __attribute__((section("sfrs"),address(0xBF80806C)));
#define T3CON T3CON
extern volatile uint32_t   T3CON __attribute__((section("sfrs"), address(0xBF808080)));
typedef union {
  struct {
    uint32_t :1;
    uint32_t TCS:1;
    uint32_t :1;
    uint32_t T32:1;
    uint32_t TCKPS:3;
    uint32_t TGATE:1;
    uint32_t :5;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t :4;
    uint32_t TCKPS0:1;
    uint32_t TCKPS1:1;
    uint32_t TCKPS2:1;
  };
  struct {
    uint32_t :13;
    uint32_t TSIDL:1;
    uint32_t :1;
    uint32_t TON:1;
  };
  struct {
    uint32_t w:32;
  };
} __T3CONbits_t;
extern volatile __T3CONbits_t T3CONbits __asm__ ("T3CON") __attribute__((section("sfrs"), address(0xBF808080)));
extern volatile uint32_t        T3CONCLR __attribute__((section("sfrs"),address(0xBF808084)));
extern volatile uint32_t        T3CONSET __attribute__((section("sfrs"),address(0xBF808088)));
extern volatile uint32_t        T3CONINV __attribute__((section("sfrs"),address(0xBF80808C)));
#define TMR3 TMR3
extern volatile uint32_t   TMR3 __attribute__((section("sfrs"), address(0xBF808090)));
extern volatile uint32_t        TMR3CLR __attribute__((section("sfrs"),address(0xBF808094)));
extern volatile uint32_t        TMR3SET __attribute__((section("sfrs"),address(0xBF808098)));
extern volatile uint32_t        TMR3INV __attribute__((section("sfrs"),address(0xBF80809C)));
#define PR3 PR3
extern volatile uint32_t   PR3 __attribute__((section("sfrs"), address(0xBF8080A0)));
extern volatile uint32_t        PR3CLR __attribute__((section("sfrs"),address(0xBF8080A4)));
extern volatile uint32_t        PR3SET __attribute__((section("sfrs"),address(0xBF8080A8)));
extern volatile uint32_t        PR3INV __attribute__((section("sfrs"),address(0xBF8080AC)));
#define SPI1CON SPI1CON
extern volatile uint32_t   SPI1CON __attribute__((section("sfrs"), address(0xBF808100)));
typedef union {
  struct {
    uint32_t SRXISEL:2;
    uint32_t STXISEL:2;
    uint32_t DISSDI:1;
    uint32_t MSTEN:1;
    uint32_t CKP:1;
    uint32_t SSEN:1;
    uint32_t CKE:1;
    uint32_t SMP:1;
    uint32_t MODE16:1;
    uint32_t MODE32:1;
    uint32_t DISSDO:1;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
    uint32_t ENHBUF:1;
    uint32_t SPIFE:1;
    uint32_t :5;
    uint32_t MCLKSEL:1;
    uint32_t FRMCNT:3;
    uint32_t FRMSYPW:1;
    uint32_t MSSEN:1;
    uint32_t FRMPOL:1;
    uint32_t FRMSYNC:1;
    uint32_t FRMEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __SPI1CONbits_t;
extern volatile __SPI1CONbits_t SPI1CONbits __asm__ ("SPI1CON") __attribute__((section("sfrs"), address(0xBF808100)));
extern volatile uint32_t        SPI1CONCLR __attribute__((section("sfrs"),address(0xBF808104)));
extern volatile uint32_t        SPI1CONSET __attribute__((section("sfrs"),address(0xBF808108)));
extern volatile uint32_t        SPI1CONINV __attribute__((section("sfrs"),address(0xBF80810C)));
#define SPI1STAT SPI1STAT
extern volatile uint32_t   SPI1STAT __attribute__((section("sfrs"), address(0xBF808110)));
typedef union {
  struct {
    uint32_t SPIRBF:1;
    uint32_t SPITBF:1;
    uint32_t :1;
    uint32_t SPITBE:1;
    uint32_t :1;
    uint32_t SPIRBE:1;
    uint32_t SPIROV:1;
    uint32_t SRMT:1;
    uint32_t SPITUR:1;
    uint32_t :2;
    uint32_t SPIBUSY:1;
    uint32_t FRMERR:1;
    uint32_t :3;
    uint32_t TXBUFELM:5;
    uint32_t :3;
    uint32_t RXBUFELM:5;
  };
  struct {
    uint32_t w:32;
  };
} __SPI1STATbits_t;
extern volatile __SPI1STATbits_t SPI1STATbits __asm__ ("SPI1STAT") __attribute__((section("sfrs"), address(0xBF808110)));
extern volatile uint32_t        SPI1STATCLR __attribute__((section("sfrs"),address(0xBF808114)));
extern volatile uint32_t        SPI1STATSET __attribute__((section("sfrs"),address(0xBF808118)));
extern volatile uint32_t        SPI1STATINV __attribute__((section("sfrs"),address(0xBF80811C)));
#define SPI1BUF SPI1BUF
extern volatile uint32_t   SPI1BUF __attribute__((section("sfrs"), address(0xBF808120)));
#define SPI1BRG SPI1BRG
extern volatile uint32_t   SPI1BRG __attribute__((section("sfrs"), address(0xBF808130)));
extern volatile uint32_t        SPI1BRGCLR __attribute__((section("sfrs"),address(0xBF808134)));
extern volatile uint32_t        SPI1BRGSET __attribute__((section("sfrs"),address(0xBF808138)));
extern volatile uint32_t        SPI1BRGINV __attribute__((section("sfrs"),address(0xBF80813C)));
#define SPI1CON2 SPI1CON2
extern volatile uint32_t   SPI1CON2 __attribute__((section("sfrs"), address(0xBF808140)));
typedef union {
  struct {
    uint32_t AUDMOD:2;
    uint32_t :1;
    uint32_t AUDMONO:1;
    uint32_t :3;
    uint32_t AUDEN:1;
    uint32_t IGNTUR:1;
    uint32_t IGNROV:1;
    uint32_t SPITUREN:1;
    uint32_t SPIROVEN:1;
    uint32_t FRMERREN:1;
    uint32_t :2;
    uint32_t SPISGNEXT:1;
  };
  struct {
    uint32_t AUDMOD0:1;
    uint32_t AUDMOD1:1;
  };
  struct {
    uint32_t w:32;
  };
} __SPI1CON2bits_t;
extern volatile __SPI1CON2bits_t SPI1CON2bits __asm__ ("SPI1CON2") __attribute__((section("sfrs"), address(0xBF808140)));
extern volatile uint32_t        SPI1CON2CLR __attribute__((section("sfrs"),address(0xBF808144)));
extern volatile uint32_t        SPI1CON2SET __attribute__((section("sfrs"),address(0xBF808148)));
extern volatile uint32_t        SPI1CON2INV __attribute__((section("sfrs"),address(0xBF80814C)));
#define SPI2CON SPI2CON
extern volatile uint32_t   SPI2CON __attribute__((section("sfrs"), address(0xBF808200)));
typedef union {
  struct {
    uint32_t SRXISEL:2;
    uint32_t STXISEL:2;
    uint32_t DISSDI:1;
    uint32_t MSTEN:1;
    uint32_t CKP:1;
    uint32_t SSEN:1;
    uint32_t CKE:1;
    uint32_t SMP:1;
    uint32_t MODE16:1;
    uint32_t MODE32:1;
    uint32_t DISSDO:1;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
    uint32_t ENHBUF:1;
    uint32_t SPIFE:1;
    uint32_t :5;
    uint32_t MCLKSEL:1;
    uint32_t FRMCNT:3;
    uint32_t FRMSYPW:1;
    uint32_t MSSEN:1;
    uint32_t FRMPOL:1;
    uint32_t FRMSYNC:1;
    uint32_t FRMEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __SPI2CONbits_t;
extern volatile __SPI2CONbits_t SPI2CONbits __asm__ ("SPI2CON") __attribute__((section("sfrs"), address(0xBF808200)));
extern volatile uint32_t        SPI2CONCLR __attribute__((section("sfrs"),address(0xBF808204)));
extern volatile uint32_t        SPI2CONSET __attribute__((section("sfrs"),address(0xBF808208)));
extern volatile uint32_t        SPI2CONINV __attribute__((section("sfrs"),address(0xBF80820C)));
#define SPI2STAT SPI2STAT
extern volatile uint32_t   SPI2STAT __attribute__((section("sfrs"), address(0xBF808210)));
typedef union {
  struct {
    uint32_t SPIRBF:1;
    uint32_t SPITBF:1;
    uint32_t :1;
    uint32_t SPITBE:1;
    uint32_t :1;
    uint32_t SPIRBE:1;
    uint32_t SPIROV:1;
    uint32_t SRMT:1;
    uint32_t SPITUR:1;
    uint32_t :2;
    uint32_t SPIBUSY:1;
    uint32_t FRMERR:1;
    uint32_t :3;
    uint32_t TXBUFELM:5;
    uint32_t :3;
    uint32_t RXBUFELM:5;
  };
  struct {
    uint32_t w:32;
  };
} __SPI2STATbits_t;
extern volatile __SPI2STATbits_t SPI2STATbits __asm__ ("SPI2STAT") __attribute__((section("sfrs"), address(0xBF808210)));
extern volatile uint32_t        SPI2STATCLR __attribute__((section("sfrs"),address(0xBF808214)));
extern volatile uint32_t        SPI2STATSET __attribute__((section("sfrs"),address(0xBF808218)));
extern volatile uint32_t        SPI2STATINV __attribute__((section("sfrs"),address(0xBF80821C)));
#define SPI2BUF SPI2BUF
extern volatile uint32_t   SPI2BUF __attribute__((section("sfrs"), address(0xBF808220)));
#define SPI2BRG SPI2BRG
extern volatile uint32_t   SPI2BRG __attribute__((section("sfrs"), address(0xBF808230)));
extern volatile uint32_t        SPI2BRGCLR __attribute__((section("sfrs"),address(0xBF808234)));
extern volatile uint32_t        SPI2BRGSET __attribute__((section("sfrs"),address(0xBF808238)));
extern volatile uint32_t        SPI2BRGINV __attribute__((section("sfrs"),address(0xBF80823C)));
#define SPI2CON2 SPI2CON2
extern volatile uint32_t   SPI2CON2 __attribute__((section("sfrs"), address(0xBF808240)));
typedef union {
  struct {
    uint32_t AUDMOD:2;
    uint32_t :1;
    uint32_t AUDMONO:1;
    uint32_t :3;
    uint32_t AUDEN:1;
    uint32_t IGNTUR:1;
    uint32_t IGNROV:1;
    uint32_t SPITUREN:1;
    uint32_t SPIROVEN:1;
    uint32_t FRMERREN:1;
    uint32_t :2;
    uint32_t SPISGNEXT:1;
  };
  struct {
    uint32_t AUDMOD0:1;
    uint32_t AUDMOD1:1;
  };
  struct {
    uint32_t w:32;
  };
} __SPI2CON2bits_t;
extern volatile __SPI2CON2bits_t SPI2CON2bits __asm__ ("SPI2CON2") __attribute__((section("sfrs"), address(0xBF808240)));
extern volatile uint32_t        SPI2CON2CLR __attribute__((section("sfrs"),address(0xBF808244)));
extern volatile uint32_t        SPI2CON2SET __attribute__((section("sfrs"),address(0xBF808248)));
extern volatile uint32_t        SPI2CON2INV __attribute__((section("sfrs"),address(0xBF80824C)));
#define SPI3CON SPI3CON
extern volatile uint32_t   SPI3CON __attribute__((section("sfrs"), address(0xBF808300)));
typedef union {
  struct {
    uint32_t SRXISEL:2;
    uint32_t STXISEL:2;
    uint32_t DISSDI:1;
    uint32_t MSTEN:1;
    uint32_t CKP:1;
    uint32_t SSEN:1;
    uint32_t CKE:1;
    uint32_t SMP:1;
    uint32_t MODE16:1;
    uint32_t MODE32:1;
    uint32_t DISSDO:1;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
    uint32_t ENHBUF:1;
    uint32_t SPIFE:1;
    uint32_t :5;
    uint32_t MCLKSEL:1;
    uint32_t FRMCNT:3;
    uint32_t FRMSYPW:1;
    uint32_t MSSEN:1;
    uint32_t FRMPOL:1;
    uint32_t FRMSYNC:1;
    uint32_t FRMEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __SPI3CONbits_t;
extern volatile __SPI3CONbits_t SPI3CONbits __asm__ ("SPI3CON") __attribute__((section("sfrs"), address(0xBF808300)));
extern volatile uint32_t        SPI3CONCLR __attribute__((section("sfrs"),address(0xBF808304)));
extern volatile uint32_t        SPI3CONSET __attribute__((section("sfrs"),address(0xBF808308)));
extern volatile uint32_t        SPI3CONINV __attribute__((section("sfrs"),address(0xBF80830C)));
#define SPI3STAT SPI3STAT
extern volatile uint32_t   SPI3STAT __attribute__((section("sfrs"), address(0xBF808310)));
typedef union {
  struct {
    uint32_t SPIRBF:1;
    uint32_t SPITBF:1;
    uint32_t :1;
    uint32_t SPITBE:1;
    uint32_t :1;
    uint32_t SPIRBE:1;
    uint32_t SPIROV:1;
    uint32_t SRMT:1;
    uint32_t SPITUR:1;
    uint32_t :2;
    uint32_t SPIBUSY:1;
    uint32_t FRMERR:1;
    uint32_t :3;
    uint32_t TXBUFELM:5;
    uint32_t :3;
    uint32_t RXBUFELM:5;
  };
  struct {
    uint32_t w:32;
  };
} __SPI3STATbits_t;
extern volatile __SPI3STATbits_t SPI3STATbits __asm__ ("SPI3STAT") __attribute__((section("sfrs"), address(0xBF808310)));
extern volatile uint32_t        SPI3STATCLR __attribute__((section("sfrs"),address(0xBF808314)));
extern volatile uint32_t        SPI3STATSET __attribute__((section("sfrs"),address(0xBF808318)));
extern volatile uint32_t        SPI3STATINV __attribute__((section("sfrs"),address(0xBF80831C)));
#define SPI3BUF SPI3BUF
extern volatile uint32_t   SPI3BUF __attribute__((section("sfrs"), address(0xBF808320)));
#define SPI3BRG SPI3BRG
extern volatile uint32_t   SPI3BRG __attribute__((section("sfrs"), address(0xBF808330)));
extern volatile uint32_t        SPI3BRGCLR __attribute__((section("sfrs"),address(0xBF808334)));
extern volatile uint32_t        SPI3BRGSET __attribute__((section("sfrs"),address(0xBF808338)));
extern volatile uint32_t        SPI3BRGINV __attribute__((section("sfrs"),address(0xBF80833C)));
#define SPI3CON2 SPI3CON2
extern volatile uint32_t   SPI3CON2 __attribute__((section("sfrs"), address(0xBF808340)));
typedef union {
  struct {
    uint32_t AUDMOD:2;
    uint32_t :1;
    uint32_t AUDMONO:1;
    uint32_t :3;
    uint32_t AUDEN:1;
    uint32_t IGNTUR:1;
    uint32_t IGNROV:1;
    uint32_t SPITUREN:1;
    uint32_t SPIROVEN:1;
    uint32_t FRMERREN:1;
    uint32_t :2;
    uint32_t SPISGNEXT:1;
  };
  struct {
    uint32_t AUDMOD0:1;
    uint32_t AUDMOD1:1;
  };
  struct {
    uint32_t w:32;
  };
} __SPI3CON2bits_t;
extern volatile __SPI3CON2bits_t SPI3CON2bits __asm__ ("SPI3CON2") __attribute__((section("sfrs"), address(0xBF808340)));
extern volatile uint32_t        SPI3CON2CLR __attribute__((section("sfrs"),address(0xBF808344)));
extern volatile uint32_t        SPI3CON2SET __attribute__((section("sfrs"),address(0xBF808348)));
extern volatile uint32_t        SPI3CON2INV __attribute__((section("sfrs"),address(0xBF80834C)));
#define U1OTGIR U1OTGIR
extern volatile uint32_t   U1OTGIR __attribute__((section("sfrs"), address(0xBF808440)));
typedef struct {
  uint32_t VBUSVDIF:1;
  uint32_t :1;
  uint32_t SESENDIF:1;
  uint32_t SESVDIF:1;
  uint32_t ACTVIF:1;
  uint32_t LSTATEIF:1;
  uint32_t T1MSECIF:1;
  uint32_t IDIF:1;
} __U1OTGIRbits_t;
extern volatile __U1OTGIRbits_t U1OTGIRbits __asm__ ("U1OTGIR") __attribute__((section("sfrs"), address(0xBF808440)));
extern volatile uint32_t        U1OTGIRCLR __attribute__((section("sfrs"),address(0xBF808444)));
#define U1OTGIE U1OTGIE
extern volatile uint32_t   U1OTGIE __attribute__((section("sfrs"), address(0xBF808450)));
typedef struct {
  uint32_t VBUSVDIE:1;
  uint32_t :1;
  uint32_t SESENDIE:1;
  uint32_t SESVDIE:1;
  uint32_t ACTVIE:1;
  uint32_t LSTATEIE:1;
  uint32_t T1MSECIE:1;
  uint32_t IDIE:1;
} __U1OTGIEbits_t;
