Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM-GPM-0XX_DFP/1.3.50/include/proc/p32mm0128gpm036.h
#define _RTCDATE_MTHONE_POSITION                 0x00000010
#define _RTCDATE_MTHONE_MASK                     0x000F0000
#define _RTCDATE_MTHONE_LENGTH                   0x00000004

#define _RTCDATE_MTHTEN_POSITION                 0x00000014
#define _RTCDATE_MTHTEN_MASK                     0x00100000
#define _RTCDATE_MTHTEN_LENGTH                   0x00000001

#define _RTCDATE_YRONE_POSITION                  0x00000018
#define _RTCDATE_YRONE_MASK                      0x0F000000
#define _RTCDATE_YRONE_LENGTH                    0x00000004

#define _RTCDATE_YRTEN_POSITION                  0x0000001C
#define _RTCDATE_YRTEN_MASK                      0xF0000000
#define _RTCDATE_YRTEN_LENGTH                    0x00000004

#define _ALMTIME_SECONE_POSITION                 0x00000008
#define _ALMTIME_SECONE_MASK                     0x00000F00
#define _ALMTIME_SECONE_LENGTH                   0x00000004

#define _ALMTIME_SECTEN_POSITION                 0x0000000C
#define _ALMTIME_SECTEN_MASK                     0x00007000
#define _ALMTIME_SECTEN_LENGTH                   0x00000003

#define _ALMTIME_MINONE_POSITION                 0x00000010
#define _ALMTIME_MINONE_MASK                     0x000F0000
#define _ALMTIME_MINONE_LENGTH                   0x00000004

#define _ALMTIME_MINTEN_POSITION                 0x00000014
#define _ALMTIME_MINTEN_MASK                     0x00700000
#define _ALMTIME_MINTEN_LENGTH                   0x00000003

#define _ALMTIME_HRONE_POSITION                  0x00000018
#define _ALMTIME_HRONE_MASK                      0x0F000000
#define _ALMTIME_HRONE_LENGTH                    0x00000004

#define _ALMTIME_HRTEN_POSITION                  0x0000001C
#define _ALMTIME_HRTEN_MASK                      0x70000000
#define _ALMTIME_HRTEN_LENGTH                    0x00000003

#define _ALMDATE_WDAY_POSITION                   0x00000000
#define _ALMDATE_WDAY_MASK                       0x00000007
#define _ALMDATE_WDAY_LENGTH                     0x00000003

#define _ALMDATE_DAYONE_POSITION                 0x00000008
#define _ALMDATE_DAYONE_MASK                     0x00000F00
#define _ALMDATE_DAYONE_LENGTH                   0x00000004

#define _ALMDATE_DAYTEN_POSITION                 0x0000000C
#define _ALMDATE_DAYTEN_MASK                     0x00003000
#define _ALMDATE_DAYTEN_LENGTH                   0x00000002

#define _ALMDATE_MTHONE_POSITION                 0x00000010
#define _ALMDATE_MTHONE_MASK                     0x000F0000
#define _ALMDATE_MTHONE_LENGTH                   0x00000004

#define _ALMDATE_MTHTEN_POSITION                 0x00000014
#define _ALMDATE_MTHTEN_MASK                     0x00100000
#define _ALMDATE_MTHTEN_LENGTH                   0x00000001

#define _CCP1CON1_MOD_POSITION                   0x00000000
#define _CCP1CON1_MOD_MASK                       0x0000000F
#define _CCP1CON1_MOD_LENGTH                     0x00000004

#define _CCP1CON1_CCSEL_POSITION                 0x00000004
#define _CCP1CON1_CCSEL_MASK                     0x00000010
#define _CCP1CON1_CCSEL_LENGTH                   0x00000001

#define _CCP1CON1_T32_POSITION                   0x00000005
#define _CCP1CON1_T32_MASK                       0x00000020
#define _CCP1CON1_T32_LENGTH                     0x00000001

#define _CCP1CON1_TMRPS_POSITION                 0x00000006
#define _CCP1CON1_TMRPS_MASK                     0x000000C0
#define _CCP1CON1_TMRPS_LENGTH                   0x00000002

#define _CCP1CON1_CLKSEL_POSITION                0x00000008
#define _CCP1CON1_CLKSEL_MASK                    0x00000700
#define _CCP1CON1_CLKSEL_LENGTH                  0x00000003

#define _CCP1CON1_TMRSYNC_POSITION               0x0000000B
#define _CCP1CON1_TMRSYNC_MASK                   0x00000800
#define _CCP1CON1_TMRSYNC_LENGTH                 0x00000001

#define _CCP1CON1_CCPSLP_POSITION                0x0000000C
#define _CCP1CON1_CCPSLP_MASK                    0x00001000
#define _CCP1CON1_CCPSLP_LENGTH                  0x00000001

#define _CCP1CON1_SIDL_POSITION                  0x0000000D
#define _CCP1CON1_SIDL_MASK                      0x00002000
#define _CCP1CON1_SIDL_LENGTH                    0x00000001

#define _CCP1CON1_ON_POSITION                    0x0000000F
#define _CCP1CON1_ON_MASK                        0x00008000
#define _CCP1CON1_ON_LENGTH                      0x00000001

#define _CCP1CON1_SYNC_POSITION                  0x00000010
#define _CCP1CON1_SYNC_MASK                      0x001F0000
#define _CCP1CON1_SYNC_LENGTH                    0x00000005

#define _CCP1CON1_ALTSYNC_POSITION               0x00000015
#define _CCP1CON1_ALTSYNC_MASK                   0x00200000
#define _CCP1CON1_ALTSYNC_LENGTH                 0x00000001

#define _CCP1CON1_ONESHOT_POSITION               0x00000016
#define _CCP1CON1_ONESHOT_MASK                   0x00400000
#define _CCP1CON1_ONESHOT_LENGTH                 0x00000001

#define _CCP1CON1_TRIGEN_POSITION                0x00000017
#define _CCP1CON1_TRIGEN_MASK                    0x00800000
#define _CCP1CON1_TRIGEN_LENGTH                  0x00000001

#define _CCP1CON1_OPS_POSITION                   0x00000018
#define _CCP1CON1_OPS_MASK                       0x0F000000
#define _CCP1CON1_OPS_LENGTH                     0x00000004

#define _CCP1CON1_RTRGEN_POSITION                0x0000001E
#define _CCP1CON1_RTRGEN_MASK                    0x40000000
#define _CCP1CON1_RTRGEN_LENGTH                  0x00000001

#define _CCP1CON1_OPSSRC_POSITION                0x0000001F
#define _CCP1CON1_OPSSRC_MASK                    0x80000000
#define _CCP1CON1_OPSSRC_LENGTH                  0x00000001

#define _CCP1CON2_ASDG_POSITION                  0x00000000
#define _CCP1CON2_ASDG_MASK                      0x000000FF
#define _CCP1CON2_ASDG_LENGTH                    0x00000008

#define _CCP1CON2_SSDG_POSITION                  0x0000000C
#define _CCP1CON2_SSDG_MASK                      0x00001000
#define _CCP1CON2_SSDG_LENGTH                    0x00000001

#define _CCP1CON2_ASDGM_POSITION                 0x0000000E
#define _CCP1CON2_ASDGM_MASK                     0x00004000
#define _CCP1CON2_ASDGM_LENGTH                   0x00000001

#define _CCP1CON2_PWMRSEN_POSITION               0x0000000F
#define _CCP1CON2_PWMRSEN_MASK                   0x00008000
#define _CCP1CON2_PWMRSEN_LENGTH                 0x00000001

#define _CCP1CON2_ICS_POSITION                   0x00000010
#define _CCP1CON2_ICS_MASK                       0x00070000
#define _CCP1CON2_ICS_LENGTH                     0x00000003

