Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM-GPM-0XX_DFP/1.3.50/include/proc/p32mm0128gpm036.h
#define _CCP2BUF_BUFH_POSITION                   0x00000010
#define _CCP2BUF_BUFH_MASK                       0xFFFF0000
#define _CCP2BUF_BUFH_LENGTH                     0x00000010

#define _CCP2BUF_BUF_POSITION                    0x00000000
#define _CCP2BUF_BUF_MASK                        0xFFFFFFFF
#define _CCP2BUF_BUF_LENGTH                      0x00000020

#define _CCP3CON1_MOD_POSITION                   0x00000000
#define _CCP3CON1_MOD_MASK                       0x0000000F
#define _CCP3CON1_MOD_LENGTH                     0x00000004

#define _CCP3CON1_CCSEL_POSITION                 0x00000004
#define _CCP3CON1_CCSEL_MASK                     0x00000010
#define _CCP3CON1_CCSEL_LENGTH                   0x00000001

#define _CCP3CON1_T32_POSITION                   0x00000005
#define _CCP3CON1_T32_MASK                       0x00000020
#define _CCP3CON1_T32_LENGTH                     0x00000001

#define _CCP3CON1_TMRPS_POSITION                 0x00000006
#define _CCP3CON1_TMRPS_MASK                     0x000000C0
#define _CCP3CON1_TMRPS_LENGTH                   0x00000002

#define _CCP3CON1_CLKSEL_POSITION                0x00000008
#define _CCP3CON1_CLKSEL_MASK                    0x00000700
#define _CCP3CON1_CLKSEL_LENGTH                  0x00000003

#define _CCP3CON1_TMRSYNC_POSITION               0x0000000B
#define _CCP3CON1_TMRSYNC_MASK                   0x00000800
#define _CCP3CON1_TMRSYNC_LENGTH                 0x00000001

#define _CCP3CON1_CCPSLP_POSITION                0x0000000C
#define _CCP3CON1_CCPSLP_MASK                    0x00001000
#define _CCP3CON1_CCPSLP_LENGTH                  0x00000001

#define _CCP3CON1_SIDL_POSITION                  0x0000000D
#define _CCP3CON1_SIDL_MASK                      0x00002000
#define _CCP3CON1_SIDL_LENGTH                    0x00000001

#define _CCP3CON1_ON_POSITION                    0x0000000F
#define _CCP3CON1_ON_MASK                        0x00008000
#define _CCP3CON1_ON_LENGTH                      0x00000001

#define _CCP3CON1_SYNC_POSITION                  0x00000010
#define _CCP3CON1_SYNC_MASK                      0x001F0000
#define _CCP3CON1_SYNC_LENGTH                    0x00000005

#define _CCP3CON1_ALTSYNC_POSITION               0x00000015
#define _CCP3CON1_ALTSYNC_MASK                   0x00200000
#define _CCP3CON1_ALTSYNC_LENGTH                 0x00000001

#define _CCP3CON1_ONESHOT_POSITION               0x00000016
#define _CCP3CON1_ONESHOT_MASK                   0x00400000
#define _CCP3CON1_ONESHOT_LENGTH                 0x00000001

#define _CCP3CON1_TRIGEN_POSITION                0x00000017
#define _CCP3CON1_TRIGEN_MASK                    0x00800000
#define _CCP3CON1_TRIGEN_LENGTH                  0x00000001

#define _CCP3CON1_OPS_POSITION                   0x00000018
#define _CCP3CON1_OPS_MASK                       0x0F000000
#define _CCP3CON1_OPS_LENGTH                     0x00000004

#define _CCP3CON1_RTRGEN_POSITION                0x0000001E
#define _CCP3CON1_RTRGEN_MASK                    0x40000000
#define _CCP3CON1_RTRGEN_LENGTH                  0x00000001

#define _CCP3CON1_OPSSRC_POSITION                0x0000001F
#define _CCP3CON1_OPSSRC_MASK                    0x80000000
#define _CCP3CON1_OPSSRC_LENGTH                  0x00000001

#define _CCP3CON2_ASDG_POSITION                  0x00000000
#define _CCP3CON2_ASDG_MASK                      0x000000FF
#define _CCP3CON2_ASDG_LENGTH                    0x00000008

#define _CCP3CON2_SSDG_POSITION                  0x0000000C
#define _CCP3CON2_SSDG_MASK                      0x00001000
#define _CCP3CON2_SSDG_LENGTH                    0x00000001

#define _CCP3CON2_ASDGM_POSITION                 0x0000000E
#define _CCP3CON2_ASDGM_MASK                     0x00004000
#define _CCP3CON2_ASDGM_LENGTH                   0x00000001

#define _CCP3CON2_PWMRSEN_POSITION               0x0000000F
#define _CCP3CON2_PWMRSEN_MASK                   0x00008000
#define _CCP3CON2_PWMRSEN_LENGTH                 0x00000001

#define _CCP3CON2_ICS_POSITION                   0x00000010
#define _CCP3CON2_ICS_MASK                       0x00070000
#define _CCP3CON2_ICS_LENGTH                     0x00000003

#define _CCP3CON2_AUXOUT_POSITION                0x00000013
#define _CCP3CON2_AUXOUT_MASK                    0x00180000
#define _CCP3CON2_AUXOUT_LENGTH                  0x00000002

#define _CCP3CON2_ICGSM_POSITION                 0x00000016
#define _CCP3CON2_ICGSM_MASK                     0x00C00000
#define _CCP3CON2_ICGSM_LENGTH                   0x00000002

#define _CCP3CON2_OCAEN_POSITION                 0x00000018
#define _CCP3CON2_OCAEN_MASK                     0x01000000
#define _CCP3CON2_OCAEN_LENGTH                   0x00000001

#define _CCP3CON2_OCBEN_POSITION                 0x00000019
#define _CCP3CON2_OCBEN_MASK                     0x02000000
#define _CCP3CON2_OCBEN_LENGTH                   0x00000001

#define _CCP3CON2_OCCEN_POSITION                 0x0000001A
#define _CCP3CON2_OCCEN_MASK                     0x04000000
#define _CCP3CON2_OCCEN_LENGTH                   0x00000001

#define _CCP3CON2_OCDEN_POSITION                 0x0000001B
#define _CCP3CON2_OCDEN_MASK                     0x08000000
#define _CCP3CON2_OCDEN_LENGTH                   0x00000001

#define _CCP3CON2_OCEEN_POSITION                 0x0000001C
#define _CCP3CON2_OCEEN_MASK                     0x10000000
#define _CCP3CON2_OCEEN_LENGTH                   0x00000001

#define _CCP3CON2_OCFEN_POSITION                 0x0000001D
#define _CCP3CON2_OCFEN_MASK                     0x20000000
#define _CCP3CON2_OCFEN_LENGTH                   0x00000001

#define _CCP3CON2_OENSYNC_POSITION               0x0000001F
#define _CCP3CON2_OENSYNC_MASK                   0x80000000
#define _CCP3CON2_OENSYNC_LENGTH                 0x00000001

#define _CCP3CON3_DT_POSITION                    0x00000000
#define _CCP3CON3_DT_MASK                        0x0000003F
#define _CCP3CON3_DT_LENGTH                      0x00000006

#define _CCP3CON3_PSSBDF_POSITION                0x00000010
#define _CCP3CON3_PSSBDF_MASK                    0x00030000
#define _CCP3CON3_PSSBDF_LENGTH                  0x00000002

#define _CCP3CON3_PSSACE_POSITION                0x00000012
#define _CCP3CON3_PSSACE_MASK                    0x000C0000
#define _CCP3CON3_PSSACE_LENGTH                  0x00000002

