Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM-GPM-0XX_DFP/1.3.50/include/proc/p32mm0128gpm036.h
#define _CCP8CON2_SSDG_POSITION                  0x0000000C
#define _CCP8CON2_SSDG_MASK                      0x00001000
#define _CCP8CON2_SSDG_LENGTH                    0x00000001

#define _CCP8CON2_ASDGM_POSITION                 0x0000000E
#define _CCP8CON2_ASDGM_MASK                     0x00004000
#define _CCP8CON2_ASDGM_LENGTH                   0x00000001

#define _CCP8CON2_PWMRSEN_POSITION               0x0000000F
#define _CCP8CON2_PWMRSEN_MASK                   0x00008000
#define _CCP8CON2_PWMRSEN_LENGTH                 0x00000001

#define _CCP8CON2_ICS_POSITION                   0x00000010
#define _CCP8CON2_ICS_MASK                       0x00070000
#define _CCP8CON2_ICS_LENGTH                     0x00000003

#define _CCP8CON2_AUXOUT_POSITION                0x00000013
#define _CCP8CON2_AUXOUT_MASK                    0x00180000
#define _CCP8CON2_AUXOUT_LENGTH                  0x00000002

#define _CCP8CON2_ICGSM_POSITION                 0x00000016
#define _CCP8CON2_ICGSM_MASK                     0x00C00000
#define _CCP8CON2_ICGSM_LENGTH                   0x00000002

#define _CCP8CON2_OCAEN_POSITION                 0x00000018
#define _CCP8CON2_OCAEN_MASK                     0x01000000
#define _CCP8CON2_OCAEN_LENGTH                   0x00000001

#define _CCP8CON2_OENSYNC_POSITION               0x0000001F
#define _CCP8CON2_OENSYNC_MASK                   0x80000000
#define _CCP8CON2_OENSYNC_LENGTH                 0x00000001

#define _CCP8CON3_PSSACE_POSITION                0x00000012
#define _CCP8CON3_PSSACE_MASK                    0x000C0000
#define _CCP8CON3_PSSACE_LENGTH                  0x00000002

#define _CCP8CON3_POLACE_POSITION                0x00000015
#define _CCP8CON3_POLACE_MASK                    0x00200000
#define _CCP8CON3_POLACE_LENGTH                  0x00000001

#define _CCP8CON3_OSCNT_POSITION                 0x0000001C
#define _CCP8CON3_OSCNT_MASK                     0x70000000
#define _CCP8CON3_OSCNT_LENGTH                   0x00000003

#define _CCP8CON3_OETRIG_POSITION                0x0000001F
#define _CCP8CON3_OETRIG_MASK                    0x80000000
#define _CCP8CON3_OETRIG_LENGTH                  0x00000001

#define _CCP8STAT_ICBNE_POSITION                 0x00000000
#define _CCP8STAT_ICBNE_MASK                     0x00000001
#define _CCP8STAT_ICBNE_LENGTH                   0x00000001

#define _CCP8STAT_ICOV_POSITION                  0x00000001
#define _CCP8STAT_ICOV_MASK                      0x00000002
#define _CCP8STAT_ICOV_LENGTH                    0x00000001

#define _CCP8STAT_ICDIS_POSITION                 0x00000002
#define _CCP8STAT_ICDIS_MASK                     0x00000004
#define _CCP8STAT_ICDIS_LENGTH                   0x00000001

#define _CCP8STAT_SCEVT_POSITION                 0x00000003
#define _CCP8STAT_SCEVT_MASK                     0x00000008
#define _CCP8STAT_SCEVT_LENGTH                   0x00000001

#define _CCP8STAT_ASEVT_POSITION                 0x00000004
#define _CCP8STAT_ASEVT_MASK                     0x00000010
#define _CCP8STAT_ASEVT_LENGTH                   0x00000001

#define _CCP8STAT_TRCLR_POSITION                 0x00000005
#define _CCP8STAT_TRCLR_MASK                     0x00000020
#define _CCP8STAT_TRCLR_LENGTH                   0x00000001

#define _CCP8STAT_TRSET_POSITION                 0x00000006
#define _CCP8STAT_TRSET_MASK                     0x00000040
#define _CCP8STAT_TRSET_LENGTH                   0x00000001

#define _CCP8STAT_CCPTRIG_POSITION               0x00000007
#define _CCP8STAT_CCPTRIG_MASK                   0x00000080
#define _CCP8STAT_CCPTRIG_LENGTH                 0x00000001

#define _CCP8STAT_ICGARM_POSITION                0x0000000A
#define _CCP8STAT_ICGARM_MASK                    0x00000400
#define _CCP8STAT_ICGARM_LENGTH                  0x00000001

#define _CCP8STAT_RAWIP_POSITION                 0x00000010
#define _CCP8STAT_RAWIP_MASK                     0x00010000
#define _CCP8STAT_RAWIP_LENGTH                   0x00000001

#define _CCP8STAT_RBWIP_POSITION                 0x00000011
#define _CCP8STAT_RBWIP_MASK                     0x00020000
#define _CCP8STAT_RBWIP_LENGTH                   0x00000001

#define _CCP8STAT_TMRLWIP_POSITION               0x00000012
#define _CCP8STAT_TMRLWIP_MASK                   0x00040000
#define _CCP8STAT_TMRLWIP_LENGTH                 0x00000001

#define _CCP8STAT_TMRHWIP_POSITION               0x00000013
#define _CCP8STAT_TMRHWIP_MASK                   0x00080000
#define _CCP8STAT_TMRHWIP_LENGTH                 0x00000001

#define _CCP8STAT_PRLWIP_POSITION                0x00000014
#define _CCP8STAT_PRLWIP_MASK                    0x00100000
#define _CCP8STAT_PRLWIP_LENGTH                  0x00000001

#define _CCP8TMR_TMRL_POSITION                   0x00000000
#define _CCP8TMR_TMRL_MASK                       0x0000FFFF
#define _CCP8TMR_TMRL_LENGTH                     0x00000010

#define _CCP8TMR_TMRH_POSITION                   0x00000010
#define _CCP8TMR_TMRH_MASK                       0xFFFF0000
#define _CCP8TMR_TMRH_LENGTH                     0x00000010

#define _CCP8TMR_TMR_POSITION                    0x00000000
#define _CCP8TMR_TMR_MASK                        0xFFFFFFFF
#define _CCP8TMR_TMR_LENGTH                      0x00000020

#define _CCP8PR_PRL_POSITION                     0x00000000
#define _CCP8PR_PRL_MASK                         0x0000FFFF
#define _CCP8PR_PRL_LENGTH                       0x00000010

#define _CCP8PR_PRH_POSITION                     0x00000010
#define _CCP8PR_PRH_MASK                         0xFFFF0000
#define _CCP8PR_PRH_LENGTH                       0x00000010

#define _CCP8PR_PR_POSITION                      0x00000000
#define _CCP8PR_PR_MASK                          0xFFFFFFFF
#define _CCP8PR_PR_LENGTH                        0x00000020

#define _CCP8RA_CMPA_POSITION                    0x00000000
#define _CCP8RA_CMPA_MASK                        0x0000FFFF
#define _CCP8RA_CMPA_LENGTH                      0x00000010

#define _CCP8RB_CMPB_POSITION                    0x00000000
#define _CCP8RB_CMPB_MASK                        0x0000FFFF
#define _CCP8RB_CMPB_LENGTH                      0x00000010

