Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM-GPM-0XX_DFP/1.3.50/include/proc/p32mm0128gpm036.h
#define _CCP9STAT_ASEVT_POSITION                 0x00000004
#define _CCP9STAT_ASEVT_MASK                     0x00000010
#define _CCP9STAT_ASEVT_LENGTH                   0x00000001

#define _CCP9STAT_TRCLR_POSITION                 0x00000005
#define _CCP9STAT_TRCLR_MASK                     0x00000020
#define _CCP9STAT_TRCLR_LENGTH                   0x00000001

#define _CCP9STAT_TRSET_POSITION                 0x00000006
#define _CCP9STAT_TRSET_MASK                     0x00000040
#define _CCP9STAT_TRSET_LENGTH                   0x00000001

#define _CCP9STAT_CCPTRIG_POSITION               0x00000007
#define _CCP9STAT_CCPTRIG_MASK                   0x00000080
#define _CCP9STAT_CCPTRIG_LENGTH                 0x00000001

#define _CCP9STAT_ICGARM_POSITION                0x0000000A
#define _CCP9STAT_ICGARM_MASK                    0x00000400
#define _CCP9STAT_ICGARM_LENGTH                  0x00000001

#define _CCP9STAT_RAWIP_POSITION                 0x00000010
#define _CCP9STAT_RAWIP_MASK                     0x00010000
#define _CCP9STAT_RAWIP_LENGTH                   0x00000001

#define _CCP9STAT_RBWIP_POSITION                 0x00000011
#define _CCP9STAT_RBWIP_MASK                     0x00020000
#define _CCP9STAT_RBWIP_LENGTH                   0x00000001

#define _CCP9STAT_TMRLWIP_POSITION               0x00000012
#define _CCP9STAT_TMRLWIP_MASK                   0x00040000
#define _CCP9STAT_TMRLWIP_LENGTH                 0x00000001

#define _CCP9STAT_TMRHWIP_POSITION               0x00000013
#define _CCP9STAT_TMRHWIP_MASK                   0x00080000
#define _CCP9STAT_TMRHWIP_LENGTH                 0x00000001

#define _CCP9STAT_PRLWIP_POSITION                0x00000014
#define _CCP9STAT_PRLWIP_MASK                    0x00100000
#define _CCP9STAT_PRLWIP_LENGTH                  0x00000001

#define _CCP9TMR_TMRL_POSITION                   0x00000000
#define _CCP9TMR_TMRL_MASK                       0x0000FFFF
#define _CCP9TMR_TMRL_LENGTH                     0x00000010

#define _CCP9TMR_TMRH_POSITION                   0x00000010
#define _CCP9TMR_TMRH_MASK                       0xFFFF0000
#define _CCP9TMR_TMRH_LENGTH                     0x00000010

#define _CCP9TMR_TMR_POSITION                    0x00000000
#define _CCP9TMR_TMR_MASK                        0xFFFFFFFF
#define _CCP9TMR_TMR_LENGTH                      0x00000020

#define _CCP9PR_PRL_POSITION                     0x00000000
#define _CCP9PR_PRL_MASK                         0x0000FFFF
#define _CCP9PR_PRL_LENGTH                       0x00000010

#define _CCP9PR_PRH_POSITION                     0x00000010
#define _CCP9PR_PRH_MASK                         0xFFFF0000
#define _CCP9PR_PRH_LENGTH                       0x00000010

#define _CCP9PR_PR_POSITION                      0x00000000
#define _CCP9PR_PR_MASK                          0xFFFFFFFF
#define _CCP9PR_PR_LENGTH                        0x00000020

#define _CCP9RA_CMPA_POSITION                    0x00000000
#define _CCP9RA_CMPA_MASK                        0x0000FFFF
#define _CCP9RA_CMPA_LENGTH                      0x00000010

#define _CCP9RB_CMPB_POSITION                    0x00000000
#define _CCP9RB_CMPB_MASK                        0x0000FFFF
#define _CCP9RB_CMPB_LENGTH                      0x00000010

#define _CCP9BUF_BUFL_POSITION                   0x00000000
#define _CCP9BUF_BUFL_MASK                       0x0000FFFF
#define _CCP9BUF_BUFL_LENGTH                     0x00000010

#define _CCP9BUF_BUFH_POSITION                   0x00000010
#define _CCP9BUF_BUFH_MASK                       0xFFFF0000
#define _CCP9BUF_BUFH_LENGTH                     0x00000010

#define _CCP9BUF_BUF_POSITION                    0x00000000
#define _CCP9BUF_BUF_MASK                        0xFFFFFFFF
#define _CCP9BUF_BUF_LENGTH                      0x00000020

#define _I2C1CON_SEN_POSITION                    0x00000000
#define _I2C1CON_SEN_MASK                        0x00000001
#define _I2C1CON_SEN_LENGTH                      0x00000001

#define _I2C1CON_RSEN_POSITION                   0x00000001
#define _I2C1CON_RSEN_MASK                       0x00000002
#define _I2C1CON_RSEN_LENGTH                     0x00000001

#define _I2C1CON_PEN_POSITION                    0x00000002
#define _I2C1CON_PEN_MASK                        0x00000004
#define _I2C1CON_PEN_LENGTH                      0x00000001

#define _I2C1CON_RCEN_POSITION                   0x00000003
#define _I2C1CON_RCEN_MASK                       0x00000008
#define _I2C1CON_RCEN_LENGTH                     0x00000001

#define _I2C1CON_ACKEN_POSITION                  0x00000004
#define _I2C1CON_ACKEN_MASK                      0x00000010
#define _I2C1CON_ACKEN_LENGTH                    0x00000001

#define _I2C1CON_ACKDT_POSITION                  0x00000005
#define _I2C1CON_ACKDT_MASK                      0x00000020
#define _I2C1CON_ACKDT_LENGTH                    0x00000001

#define _I2C1CON_STREN_POSITION                  0x00000006
#define _I2C1CON_STREN_MASK                      0x00000040
#define _I2C1CON_STREN_LENGTH                    0x00000001

#define _I2C1CON_GCEN_POSITION                   0x00000007
#define _I2C1CON_GCEN_MASK                       0x00000080
#define _I2C1CON_GCEN_LENGTH                     0x00000001

#define _I2C1CON_SMEN_POSITION                   0x00000008
#define _I2C1CON_SMEN_MASK                       0x00000100
#define _I2C1CON_SMEN_LENGTH                     0x00000001

#define _I2C1CON_DISSLW_POSITION                 0x00000009
#define _I2C1CON_DISSLW_MASK                     0x00000200
#define _I2C1CON_DISSLW_LENGTH                   0x00000001

#define _I2C1CON_A10M_POSITION                   0x0000000A
#define _I2C1CON_A10M_MASK                       0x00000400
#define _I2C1CON_A10M_LENGTH                     0x00000001

#define _I2C1CON_STRICT_POSITION                 0x0000000B
#define _I2C1CON_STRICT_MASK                     0x00000800
#define _I2C1CON_STRICT_LENGTH                   0x00000001

#define _I2C1CON_SCLREL_POSITION                 0x0000000C
#define _I2C1CON_SCLREL_MASK                     0x00001000
#define _I2C1CON_SCLREL_LENGTH                   0x00000001

