Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM-GPM-0XX_DFP/1.3.50/include/proc/p32mm0128gpm036.h
#define _RPOR0_RP3R_POSITION                     0x00000010
#define _RPOR0_RP3R_MASK                         0x001F0000
#define _RPOR0_RP3R_LENGTH                       0x00000005

#define _RPOR0_RP4R_POSITION                     0x00000018
#define _RPOR0_RP4R_MASK                         0x1F000000
#define _RPOR0_RP4R_LENGTH                       0x00000005

#define _RPOR1_RP5R_POSITION                     0x00000000
#define _RPOR1_RP5R_MASK                         0x0000001F
#define _RPOR1_RP5R_LENGTH                       0x00000005

#define _RPOR1_RP6R_POSITION                     0x00000008
#define _RPOR1_RP6R_MASK                         0x00001F00
#define _RPOR1_RP6R_LENGTH                       0x00000005

#define _RPOR1_RP7R_POSITION                     0x00000010
#define _RPOR1_RP7R_MASK                         0x001F0000
#define _RPOR1_RP7R_LENGTH                       0x00000005

#define _RPOR1_RP8R_POSITION                     0x00000018
#define _RPOR1_RP8R_MASK                         0x1F000000
#define _RPOR1_RP8R_LENGTH                       0x00000005

#define _RPOR2_RP9R_POSITION                     0x00000000
#define _RPOR2_RP9R_MASK                         0x0000001F
#define _RPOR2_RP9R_LENGTH                       0x00000005

#define _RPOR2_RP10R_POSITION                    0x00000008
#define _RPOR2_RP10R_MASK                        0x00001F00
#define _RPOR2_RP10R_LENGTH                      0x00000005

#define _RPOR2_RP11R_POSITION                    0x00000010
#define _RPOR2_RP11R_MASK                        0x001F0000
#define _RPOR2_RP11R_LENGTH                      0x00000005

#define _RPOR2_RP12R_POSITION                    0x00000018
#define _RPOR2_RP12R_MASK                        0x1F000000
#define _RPOR2_RP12R_LENGTH                      0x00000005

#define _RPOR3_RP13R_POSITION                    0x00000000
#define _RPOR3_RP13R_MASK                        0x0000001F
#define _RPOR3_RP13R_LENGTH                      0x00000005

#define _RPOR3_RP14R_POSITION                    0x00000008
#define _RPOR3_RP14R_MASK                        0x00001F00
#define _RPOR3_RP14R_LENGTH                      0x00000005

#define _RPOR3_RP15R_POSITION                    0x00000010
#define _RPOR3_RP15R_MASK                        0x001F0000
#define _RPOR3_RP15R_LENGTH                      0x00000005

#define _RPOR3_RP16R_POSITION                    0x00000018
#define _RPOR3_RP16R_MASK                        0x1F000000
#define _RPOR3_RP16R_LENGTH                      0x00000005

#define _RPOR4_RP17R_POSITION                    0x00000000
#define _RPOR4_RP17R_MASK                        0x0000001F
#define _RPOR4_RP17R_LENGTH                      0x00000005

#define _RPOR4_RP18R_POSITION                    0x00000008
#define _RPOR4_RP18R_MASK                        0x00001F00
#define _RPOR4_RP18R_LENGTH                      0x00000005

#define _RPOR4_RP19R_POSITION                    0x00000010
#define _RPOR4_RP19R_MASK                        0x001F0000
#define _RPOR4_RP19R_LENGTH                      0x00000005

#define _RPOR4_RP20R_POSITION                    0x00000018
#define _RPOR4_RP20R_MASK                        0x1F000000
#define _RPOR4_RP20R_LENGTH                      0x00000005

#define _RPOR5_RP21R_POSITION                    0x00000000
#define _RPOR5_RP21R_MASK                        0x0000001F
#define _RPOR5_RP21R_LENGTH                      0x00000005

#define _RPOR5_RP22R_POSITION                    0x00000008
#define _RPOR5_RP22R_MASK                        0x00001F00
#define _RPOR5_RP22R_LENGTH                      0x00000005

#define _RPOR5_RP23R_POSITION                    0x00000010
#define _RPOR5_RP23R_MASK                        0x001F0000
#define _RPOR5_RP23R_LENGTH                      0x00000005

#define _RPOR5_RP24R_POSITION                    0x00000018
#define _RPOR5_RP24R_MASK                        0x1F000000
#define _RPOR5_RP24R_LENGTH                      0x00000005

#define _ANSELA_ANSA0_POSITION                   0x00000000
#define _ANSELA_ANSA0_MASK                       0x00000001
#define _ANSELA_ANSA0_LENGTH                     0x00000001

#define _ANSELA_ANSA1_POSITION                   0x00000001
#define _ANSELA_ANSA1_MASK                       0x00000002
#define _ANSELA_ANSA1_LENGTH                     0x00000001

#define _ANSELA_ANSA2_POSITION                   0x00000002
#define _ANSELA_ANSA2_MASK                       0x00000004
#define _ANSELA_ANSA2_LENGTH                     0x00000001

#define _ANSELA_ANSA3_POSITION                   0x00000003
#define _ANSELA_ANSA3_MASK                       0x00000008
#define _ANSELA_ANSA3_LENGTH                     0x00000001

#define _TRISA_TRISA0_POSITION                   0x00000000
#define _TRISA_TRISA0_MASK                       0x00000001
#define _TRISA_TRISA0_LENGTH                     0x00000001

#define _TRISA_TRISA1_POSITION                   0x00000001
#define _TRISA_TRISA1_MASK                       0x00000002
#define _TRISA_TRISA1_LENGTH                     0x00000001

#define _TRISA_TRISA2_POSITION                   0x00000002
#define _TRISA_TRISA2_MASK                       0x00000004
#define _TRISA_TRISA2_LENGTH                     0x00000001

#define _TRISA_TRISA3_POSITION                   0x00000003
#define _TRISA_TRISA3_MASK                       0x00000008
#define _TRISA_TRISA3_LENGTH                     0x00000001

#define _TRISA_TRISA4_POSITION                   0x00000004
#define _TRISA_TRISA4_MASK                       0x00000010
#define _TRISA_TRISA4_LENGTH                     0x00000001

#define _TRISA_TRISA9_POSITION                   0x00000009
#define _TRISA_TRISA9_MASK                       0x00000200
#define _TRISA_TRISA9_LENGTH                     0x00000001

#define _TRISA_w_POSITION                        0x00000000
#define _TRISA_w_MASK                            0xFFFFFFFF
#define _TRISA_w_LENGTH                          0x00000020

#define _PORTA_RA0_POSITION                      0x00000000
#define _PORTA_RA0_MASK                          0x00000001
#define _PORTA_RA0_LENGTH                        0x00000001

#define _PORTA_RA1_POSITION                      0x00000001
#define _PORTA_RA1_MASK                          0x00000002
#define _PORTA_RA1_LENGTH                        0x00000001

#define _PORTA_RA2_POSITION                      0x00000002
#define _PORTA_RA2_MASK                          0x00000004
#define _PORTA_RA2_LENGTH                        0x00000001

#define _PORTA_RA3_POSITION                      0x00000003
#define _PORTA_RA3_MASK                          0x00000008
#define _PORTA_RA3_LENGTH                        0x00000001

#define _PORTA_RA4_POSITION                      0x00000004
#define _PORTA_RA4_MASK                          0x00000010
#define _PORTA_RA4_LENGTH                        0x00000001

#define _PORTA_RA9_POSITION                      0x00000009
#define _PORTA_RA9_MASK                          0x00000200
#define _PORTA_RA9_LENGTH                        0x00000001

#define _PORTA_w_POSITION                        0x00000000
#define _PORTA_w_MASK                            0xFFFFFFFF
#define _PORTA_w_LENGTH                          0x00000020

#define _LATA_LATA0_POSITION                     0x00000000
#define _LATA_LATA0_MASK                         0x00000001
#define _LATA_LATA0_LENGTH                       0x00000001

