Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM-GPM-0XX_DFP/1.3.50/include/proc/p32mm0128gpm036.h
#define _CNPDC_CNPDC2_POSITION                   0x00000002
#define _CNPDC_CNPDC2_MASK                       0x00000004
#define _CNPDC_CNPDC2_LENGTH                     0x00000001

#define _CNPDC_CNPDC3_POSITION                   0x00000003
#define _CNPDC_CNPDC3_MASK                       0x00000008
#define _CNPDC_CNPDC3_LENGTH                     0x00000001

#define _CNPDC_CNPDC8_POSITION                   0x00000008
#define _CNPDC_CNPDC8_MASK                       0x00000100
#define _CNPDC_CNPDC8_LENGTH                     0x00000001

#define _CNPDC_CNPDC9_POSITION                   0x00000009
#define _CNPDC_CNPDC9_MASK                       0x00000200
#define _CNPDC_CNPDC9_LENGTH                     0x00000001

#define _CNPDC_w_POSITION                        0x00000000
#define _CNPDC_w_MASK                            0xFFFFFFFF
#define _CNPDC_w_LENGTH                          0x00000020

#define _CNCONC_PORT32_POSITION                  0x0000000A
#define _CNCONC_PORT32_MASK                      0x00000400
#define _CNCONC_PORT32_LENGTH                    0x00000001

#define _CNCONC_CNSTYLE_POSITION                 0x0000000B
#define _CNCONC_CNSTYLE_MASK                     0x00000800
#define _CNCONC_CNSTYLE_LENGTH                   0x00000001

#define _CNCONC_ON_POSITION                      0x0000000F
#define _CNCONC_ON_MASK                          0x00008000
#define _CNCONC_ON_LENGTH                        0x00000001

#define _CNCONC_w_POSITION                       0x00000000
#define _CNCONC_w_MASK                           0xFFFFFFFF
#define _CNCONC_w_LENGTH                         0x00000020

#define _CNEN0C_CNIE0C0_POSITION                 0x00000000
#define _CNEN0C_CNIE0C0_MASK                     0x00000001
#define _CNEN0C_CNIE0C0_LENGTH                   0x00000001

#define _CNEN0C_CNIE0C1_POSITION                 0x00000001
#define _CNEN0C_CNIE0C1_MASK                     0x00000002
#define _CNEN0C_CNIE0C1_LENGTH                   0x00000001

#define _CNEN0C_CNIE0C2_POSITION                 0x00000002
#define _CNEN0C_CNIE0C2_MASK                     0x00000004
#define _CNEN0C_CNIE0C2_LENGTH                   0x00000001

#define _CNEN0C_CNIE0C3_POSITION                 0x00000003
#define _CNEN0C_CNIE0C3_MASK                     0x00000008
#define _CNEN0C_CNIE0C3_LENGTH                   0x00000001

#define _CNEN0C_CNIE0C8_POSITION                 0x00000008
#define _CNEN0C_CNIE0C8_MASK                     0x00000100
#define _CNEN0C_CNIE0C8_LENGTH                   0x00000001

#define _CNEN0C_CNIE0C9_POSITION                 0x00000009
#define _CNEN0C_CNIE0C9_MASK                     0x00000200
#define _CNEN0C_CNIE0C9_LENGTH                   0x00000001

#define _CNEN0C_w_POSITION                       0x00000000
#define _CNEN0C_w_MASK                           0xFFFFFFFF
#define _CNEN0C_w_LENGTH                         0x00000020

#define _CNSTATC_CNSTATC0_POSITION               0x00000000
#define _CNSTATC_CNSTATC0_MASK                   0x00000001
#define _CNSTATC_CNSTATC0_LENGTH                 0x00000001

#define _CNSTATC_CNSTATC1_POSITION               0x00000001
#define _CNSTATC_CNSTATC1_MASK                   0x00000002
#define _CNSTATC_CNSTATC1_LENGTH                 0x00000001

#define _CNSTATC_CNSTATC2_POSITION               0x00000002
#define _CNSTATC_CNSTATC2_MASK                   0x00000004
#define _CNSTATC_CNSTATC2_LENGTH                 0x00000001

#define _CNSTATC_CNSTATC3_POSITION               0x00000003
#define _CNSTATC_CNSTATC3_MASK                   0x00000008
#define _CNSTATC_CNSTATC3_LENGTH                 0x00000001

#define _CNSTATC_CNSTATC8_POSITION               0x00000008
#define _CNSTATC_CNSTATC8_MASK                   0x00000100
#define _CNSTATC_CNSTATC8_LENGTH                 0x00000001

#define _CNSTATC_CNSTATC9_POSITION               0x00000009
#define _CNSTATC_CNSTATC9_MASK                   0x00000200
#define _CNSTATC_CNSTATC9_LENGTH                 0x00000001

#define _CNSTATC_w_POSITION                      0x00000000
#define _CNSTATC_w_MASK                          0xFFFFFFFF
#define _CNSTATC_w_LENGTH                        0x00000020

#define _CNEN1C_CNIE1C0_POSITION                 0x00000000
#define _CNEN1C_CNIE1C0_MASK                     0x00000001
#define _CNEN1C_CNIE1C0_LENGTH                   0x00000001

#define _CNEN1C_CNIE1C1_POSITION                 0x00000001
#define _CNEN1C_CNIE1C1_MASK                     0x00000002
#define _CNEN1C_CNIE1C1_LENGTH                   0x00000001

#define _CNEN1C_CNIE1C2_POSITION                 0x00000002
#define _CNEN1C_CNIE1C2_MASK                     0x00000004
#define _CNEN1C_CNIE1C2_LENGTH                   0x00000001

#define _CNEN1C_CNIE1C3_POSITION                 0x00000003
#define _CNEN1C_CNIE1C3_MASK                     0x00000008
#define _CNEN1C_CNIE1C3_LENGTH                   0x00000001

#define _CNEN1C_CNIE1C8_POSITION                 0x00000008
#define _CNEN1C_CNIE1C8_MASK                     0x00000100
#define _CNEN1C_CNIE1C8_LENGTH                   0x00000001

#define _CNEN1C_CNIE1C9_POSITION                 0x00000009
#define _CNEN1C_CNIE1C9_MASK                     0x00000200
#define _CNEN1C_CNIE1C9_LENGTH                   0x00000001

#define _CNEN1C_w_POSITION                       0x00000000
#define _CNEN1C_w_MASK                           0xFFFFFFFF
#define _CNEN1C_w_LENGTH                         0x00000020

#define _CNFC_CNFC0_POSITION                     0x00000000
#define _CNFC_CNFC0_MASK                         0x00000001
#define _CNFC_CNFC0_LENGTH                       0x00000001

#define _CNFC_CNFC1_POSITION                     0x00000001
#define _CNFC_CNFC1_MASK                         0x00000002
#define _CNFC_CNFC1_LENGTH                       0x00000001

#define _CNFC_CNFC2_POSITION                     0x00000002
#define _CNFC_CNFC2_MASK                         0x00000004
#define _CNFC_CNFC2_LENGTH                       0x00000001

#define _CNFC_CNFC3_POSITION                     0x00000003
#define _CNFC_CNFC3_MASK                         0x00000008
#define _CNFC_CNFC3_LENGTH                       0x00000001

